In [2]:
# import modules
import pandas as pd

In [3]:
# persiapan data frame dengan dict dan list
data = {
    'col1':['1', '2', '3', 'teks'],
    'col2':['1', '2', '3', '4']
}
df = pd.DataFrame(data)
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [4]:
# mengecek tipe data
df.dtypes

col1    object
col2    object
dtype: object

In [5]:
# konversi tipe data dengan fungsi astype()
df_x = df.astype({'col2':'float'})
df_x

   col1  col2
0     1   1.0
1     2   2.0
2     3   3.0
3  teks   4.0

In [6]:
df_x.dtypes

col1     object
col2    float64
dtype: object

In [7]:
# konversi tipe data numerik dengan fungsi to_numeric()
df.apply(pd.to_numeric, errors='coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4